<a href="https://colab.research.google.com/github/19PA1A0516/Python-Basics-code/blob/master/Untitled5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [41]:
import pandas as pd
a=pd.array(["a","b","c","d"])
b=pd.Series(a)

print(b[:3])

0    a
1    b
2    c
dtype: object

In [19]:
print(b[1:4])

1    b
2    c
3    d
dtype: object

In [64]:
import pandas as pb
a=pb.DataFrame([["ram",22],["seetha",44],["preethi",55]],columns=["name","age"],index=[1,2,3])
a["marks"]=pb.Series([100,31,44],index=[1,2,3])
b=a
print(b)

      name  age  marks
1      ram   22    100
2   seetha   44     31
3  preethi   55     44

In [46]:
del b["marks"]
b

      name  age
1      ram   22
2   seetha   44
3  preethi   55

In [47]:
b.loc[1]

name    ram
age      22
Name: 1, dtype: object

In [48]:
b.loc[0:2]

     name  age
1     ram   22
2  seetha   44

In [65]:
a.loc[1:3]

      name  age  marks
1      ram   22    100
2   seetha   44     31
3  preethi   55     44

In [60]:

c=pb.DataFrame({"name":"sri","age":14,"marks":49},index=[4])
c

  name  age  marks
4  sri   14     49

In [69]:
a=a.append(c)
a

      name  age  marks
1      ram   22    100
2   seetha   44     31
3  preethi   55     44
4      sri   14     49

In [70]:
a.drop(1)

      name  age  marks
2   seetha   44     31
3  preethi   55     44
4      sri   14     49

In [77]:
a.T

         1       2        3    4
name   ram  seetha  preethi  sri
age     22      44       55   14
marks  100      31       44   49

In [76]:
a.drop(4)

      name  age  marks
1      ram   22    100
2   seetha   44     31
3  preethi   55     44

In [79]:
a.ndim

2

In [80]:
a.shape

(4, 3)

In [81]:
a.size

12